Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipld</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_collaborator.this["go-trustless-utils:rvagg"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "go-trustless-utils"
      + username                    = "rvagg"
    }

  # github_team_repository.this["go team:go-trustless-utils"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "go-trustless-utils"
      + team_id    = "2411285"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->